# 2_1904 01타일
# bottom-top 풀이

# n = 1 (1개):: 1
# n = 2 (2개):: 00, 11
# n = 3 (3개):: 100, 001, 111
# n = 4 (5개):: 0000, 0011, 1001, 1100, 1111
# n = 5 (8개):: 00001, 00100, 10000, 11100, 11001, 10011, 00111, 11111
# n = 6 (13개):: 000000, 000011, 001001, 001100, 100100, 110000, 100001
#          111100, 111001, 110011, 100111, 001111, 111111
# 개수가 피보나치와 같이 f(n) = f(n-2) + f(n-1) 을 따름
# 15746 으로 나누라는건 배열의 크기와는 관계 없고! 그냥 데이터 저장할 때 쓰면 될듯 
import sys
input = sys.stdin.readline

n = int(input().strip())
dp = [0] * 1000001
dp[1] = 1
dp[2] = 2

for i in range(3, n+1):
    dp[i] = (dp[i-2] + dp[i-1]) % 15746

print(dp[n])